lucasssvaz/arduino-esp32/libraries/BLE/src/BLEAdvertising.cpp
void BLEAdvertising::reset() {
  if (BLEDevice::getInitialized()) {
    stop();
  }

  memset(&m_scanRespData, 0, sizeof(esp_ble_adv_data_t));
  memset(&m_advData, 0, sizeof(esp_ble_adv_data_t));
  memset(&m_advParams, 0, sizeof(esp_ble_adv_params_t));

  m_advData.set_scan_rsp = false;
  m_advData.include_name = true;
  m_advData.include_txpower = true;
  m_advData.min_interval = 0x20;
  m_advData.max_interval = 0x40;
  m_advData.appearance = 0x00;
  m_advData.manufacturer_len = 0;
  m_advData.p_manufacturer_data = nullptr;
  m_advData.service_data_len = 0;
  m_advData.p_service_data = nullptr;
  m_advData.service_uuid_len = 0;
  m_advData.p_service_uuid = nullptr;
  m_advData.flag = (ESP_BLE_ADV_FLAG_GEN_DISC | ESP_BLE_ADV_FLAG_BREDR_NOT_SPT);

  m_advParams.adv_int_min = 0x20;
  m_advParams.adv_int_max = 0x40;
  m_advParams.adv_type = ADV_TYPE_IND;
  m_advParams.own_addr_type = BLE_ADDR_TYPE_PUBLIC;
  m_advParams.channel_map = ADV_CHNL_ALL;
  m_advParams.adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY;
  m_advParams.peer_addr_type = BLE_ADDR_TYPE_PUBLIC;

  m_customAdvData = false;           // No custom advertising data
  m_customScanResponseData = false;  // No custom scan response data
  m_advDataSet = false;              // Force advertising data reconfiguration
  m_advConfiguring = false;          // Not currently configuring
}  // BLEAdvertising

void BLEAdvertising::freeServiceUUIDs() {
  free(m_advData.p_service_uuid);
  m_advData.p_service_uuid = nullptr;
}

bool BLEAdvertising::configureScanResponseData() {
  memcpy(&m_scanRespData, &m_advData, sizeof(esp_ble_adv_data_t));
  m_scanRespData.set_scan_rsp = true;
  m_scanRespData.include_name = true;
  m_scanRespData.include_txpower = true;
  m_scanRespData.appearance = 0;
  m_scanRespData.flag = 0;
  esp_err_t errRc = ::esp_ble_gap_config_adv_data(&m_scanRespData);
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_config_adv_data (Scan response): rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
    return false;
  }
  return true;
}

/**
 * @brief Build raw advertising data bytes with the device name truncated to fit.
 *
 * Fields are written in priority order: flags, service UUIDs, appearance,
 * manufacturer data, service data, and finally the device name which gets
 * whatever space remains. TX power and connection interval are intentionally
 * omitted to maximise name space, matching NimBLE's behaviour. If the full
 * name does not fit, it is truncated and the AD type is set to Shortened
 * Local Name (0x08).
 *
 * @param [out] buf   Destination buffer (must be at least 31 bytes).
 * @param [in]  bufLen Size of buf.
 * @return Number of bytes written.
 */
uint16_t BLEAdvertising::buildRawAdvData(uint8_t *buf, uint16_t bufLen) {
  uint8_t *p = buf;
  uint16_t remaining = (bufLen < 31) ? bufLen : 31;

  // --- Flags ---
  if (m_advData.flag != 0 && remaining >= 3) {
    *p++ = 2;
    *p++ = ESP_BLE_AD_TYPE_FLAG;
    *p++ = m_advData.flag;
    remaining -= 3;
  }

  // --- Service UUIDs (grouped by size) ---
  // 16-bit
  {
    uint8_t *hdr = nullptr;
    for (auto &uuid : m_serviceUUIDs) {
      if (uuid.getNative()->len == ESP_UUID_LEN_16 && remaining >= (hdr ? 2u : 4u)) {
        if (!hdr) {
          hdr = p;
          *p++ = 1;
          *p++ = ESP_BLE_AD_TYPE_16SRV_CMPL;
          remaining -= 2;
        }
        uint16_t val = uuid.getNative()->uuid.uuid16;
        *p++ = val & 0xFF;
        *p++ = (val >> 8) & 0xFF;
        remaining -= 2;
        *hdr += 2;
      }
    }
  }
  // 32-bit
  {
    uint8_t *hdr = nullptr;
    for (auto &uuid : m_serviceUUIDs) {
      if (uuid.getNative()->len == ESP_UUID_LEN_32 && remaining >= (hdr ? 4u : 6u)) {
        if (!hdr) {
          hdr = p;
          *p++ = 1;
          *p++ = ESP_BLE_AD_TYPE_32SRV_CMPL;
          remaining -= 2;
        }
        uint32_t val = uuid.getNative()->uuid.uuid32;
        *p++ = val & 0xFF;
        *p++ = (val >> 8) & 0xFF;
        *p++ = (val >> 16) & 0xFF;
        *p++ = (val >> 24) & 0xFF;
        remaining -= 4;
        *hdr += 4;
      }
    }
  }
  // 128-bit (at most one in a legacy advertising PDU)
  for (auto &uuid : m_serviceUUIDs) {
    if (uuid.getNative()->len == ESP_UUID_LEN_128 && remaining >= 18) {
      *p++ = 17;
      *p++ = ESP_BLE_AD_TYPE_128SRV_CMPL;
      memcpy(p, uuid.getNative()->uuid.uuid128, 16);
      p += 16;
      remaining -= 18;
      break;
    }
  }

  // --- Appearance ---
  if (m_advData.appearance != 0 && remaining >= 4) {
    *p++ = 3;
    *p++ = ESP_BLE_AD_TYPE_APPEARANCE;
    *p++ = m_advData.appearance & 0xFF;
    *p++ = (m_advData.appearance >> 8) & 0xFF;
    remaining -= 4;
  }

  // --- Manufacturer data ---
  if (m_advData.manufacturer_len > 0 && m_advData.p_manufacturer_data
      && remaining >= (uint16_t)(2 + m_advData.manufacturer_len)) {
    *p++ = m_advData.manufacturer_len + 1;
    *p++ = ESP_BLE_AD_MANUFACTURER_SPECIFIC_TYPE;
    memcpy(p, m_advData.p_manufacturer_data, m_advData.manufacturer_len);
    p += m_advData.manufacturer_len;
    remaining -= 2 + m_advData.manufacturer_len;
  }

  // --- Service data ---
  if (m_advData.service_data_len > 0 && m_advData.p_service_data
      && remaining >= (uint16_t)(2 + m_advData.service_data_len)) {
    *p++ = m_advData.service_data_len + 1;
    *p++ = ESP_BLE_AD_TYPE_SERVICE_DATA;
    memcpy(p, m_advData.p_service_data, m_advData.service_data_len);
    p += m_advData.service_data_len;
    remaining -= 2 + m_advData.service_data_len;
  }

  // --- Device name (truncated to fit) ---
  String deviceName = BLEDevice::getDeviceName();
  uint16_t nameLen = deviceName.length();
  if (nameLen > 0 && remaining >= 3) {
    uint16_t maxChars = remaining - 2;
    bool complete = (nameLen <= maxChars);
    uint16_t actualLen = complete ? nameLen : maxChars;
    *p++ = actualLen + 1;
    *p++ = complete ? ESP_BLE_AD_TYPE_NAME_CMPL : ESP_BLE_AD_TYPE_NAME_SHORT;
    memcpy(p, deviceName.c_str(), actualLen);
    p += actualLen;
    remaining -= 2 + actualLen;
  }

