lucasssvaz/arduino-esp32/libraries/BLE/src/BLEAdvertising.cpp
  return (uint16_t)(p - buf);
}

void BLEAdvertising::setAdvertisementChannelMap(esp_ble_adv_channel_t channel_map) {
  m_advParams.channel_map = channel_map;
}  // setAdvertisementChannelMap

/**
 * @brief Start advertising.
 * Start advertising.
 * @return N/A.
 */
bool BLEAdvertising::start() {
  log_v(">> start: customAdvData: %d, customScanResponseData: %d, advDataSet: %d", m_customAdvData, m_customScanResponseData, m_advDataSet);

  // If async configuration is already in progress, don't re-enter.
  // The GAP event handler will start advertising when the config completes.
  if (m_advConfiguring) {
    log_w("Advertising configuration already in progress");
    return true;
  }

  // If advertising data needs to be (re)configured, kick off the async configuration.
  // Bluedroid's esp_ble_gap_config_adv_data() is asynchronous and fires a GAP completion
  // event when done. We must NOT block here with semaphores because start() can be called
  // from BT callbacks (e.g., the disconnect handler), and both GATT and GAP callbacks are
  // dispatched on the same BTC task - blocking would deadlock.
  // Instead, we use the same non-blocking approach as NimBLE: kick off the config and let
  // the GAP event handler (handleGAPEvent) chain the remaining steps.
  if (!m_advDataSet) {
    freeServiceUUIDs();

    if (!m_customAdvData) {
      m_advData.set_scan_rsp = false;

      if (!m_scanResp) {
        // When scan response is disabled, the name and TX power must fit in the
        // advertising packet alongside all other fields. Estimate the non-name
        // payload to decide whether the full name fits.
        //
        // The Bluedroid stack processes the device name BEFORE service UUIDs in
        // btm_ble_build_adv_data(), so blindly setting include_name=true with a
        // long name silently drops the UUIDs. When the name does not fit we
        // build raw advertising bytes ourselves, placing UUIDs first and a
        // truncated name (AD type 0x08 - Shortened Local Name) last. This
        // matches NimBLE's behaviour.
        uint16_t payloadLen = 0;
        if (m_advData.flag != 0) {
          payloadLen += 3;
        }
        payloadLen += 3;  // TX power
        if (m_advData.appearance != 0) {
          payloadLen += 4;
        }
        if (m_advData.manufacturer_len > 0) {
          payloadLen += 2 + m_advData.manufacturer_len;
        }
        if (m_advData.service_data_len > 0) {
          payloadLen += 2 + m_advData.service_data_len;
        }
        if (m_advData.min_interval > 0 && m_advData.max_interval > 0
            && m_advData.max_interval >= m_advData.min_interval) {
          payloadLen += 6;
        }
        for (auto &uuid : m_serviceUUIDs) {
          if (uuid.getNative()->len == ESP_UUID_LEN_16) {
            payloadLen += 4;
          } else if (uuid.getNative()->len == ESP_UUID_LEN_32) {
            payloadLen += 6;
          } else {
            payloadLen += 18;
          }
        }

        String deviceName = BLEDevice::getDeviceName();
        uint16_t nameNeeded = (deviceName.length() > 0) ? (deviceName.length() + 2) : 0;

        if (payloadLen + nameNeeded > 31) {
          // Name does not fit — build raw advertising data with truncated name.
          uint8_t rawBuf[31];
          uint16_t rawLen = buildRawAdvData(rawBuf, sizeof(rawBuf));
          esp_err_t errRc = ::esp_ble_gap_config_adv_data_raw(rawBuf, rawLen);
          if (errRc != ESP_OK) {
            log_e("esp_ble_gap_config_adv_data_raw: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
            return false;
          }
          m_advConfiguring = true;
          return true;
        }

        // Name fits — use the structured API (include name + TX power directly).
        m_advData.include_name = true;
        m_advData.include_txpower = true;
      } else {
        // Scan response enabled — name and TX power go in the scan response.
        m_advData.include_name = false;
        m_advData.include_txpower = false;
      }

      // Allocate a flat 128-bit UUID array for the structured API.
      int numServices = m_serviceUUIDs.size();
      if (numServices > 0) {
        m_advData.service_uuid_len = 16 * numServices;
        m_advData.p_service_uuid = (uint8_t *)malloc(m_advData.service_uuid_len);
        if (!m_advData.p_service_uuid) {
          log_e(">> start failed: out of memory");
          return false;
        }

        uint8_t *p = m_advData.p_service_uuid;
        for (int i = 0; i < numServices; i++) {
          log_d("- advertising service: %s", m_serviceUUIDs[i].toString().c_str());
          BLEUUID serviceUUID128 = m_serviceUUIDs[i].to128();
          memcpy(p, serviceUUID128.getNative()->uuid.uuid128, 16);
          p += 16;
        }
      } else {
        m_advData.service_uuid_len = 0;
        log_d("- no services advertised");
      }

      // Configure advertising data asynchronously.
      // The GAP event handler will continue the chain when config completes:
      //   ADV_DATA_SET_COMPLETE -> (scan response config if needed) -> start advertising
      esp_err_t errRc = ::esp_ble_gap_config_adv_data(&m_advData);
      if (errRc != ESP_OK) {
        log_e("<< esp_ble_gap_config_adv_data: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        freeServiceUUIDs();
        return false;
      }
      m_advConfiguring = true;
      log_d("Advertising data configuration started (async)");
      return true;
    }

    if (!m_customScanResponseData && m_scanResp) {
      // Custom adv data but auto scan response - configure scan response asynchronously.
      // The GAP event handler will start advertising when config completes.
      if (!configureScanResponseData()) {
        freeServiceUUIDs();
        return false;
      }
      m_advConfiguring = true;
      log_d("Scan response data configuration started (async)");
      return true;
    }

    // Both adv data and scan response are custom (or no scan response needed).
    // No async operations, mark as configured and proceed to start.
    m_advDataSet = true;
    freeServiceUUIDs();
  }

  // Advertising data is already configured, just start advertising.
  esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
  if (errRc != ESP_OK) {
    log_e("<< esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< start");
  }
  return ESP_OK == errRc;
}  // start

/**
 * @brief Stop advertising.
 * Stop advertising.
 * @return N/A.
 */
bool BLEAdvertising::stop() {
  log_v(">> stop");
  esp_err_t errRc = ::esp_ble_gap_stop_advertising();
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_stop_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< stop");
  }
  return ESP_OK == errRc;
}  // stop

void BLEAdvertising::handleGAPEvent(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {
  log_d("handleGAPEvent [event no: %d]", (int)event);

