lucasssvaz/arduino-esp32/libraries/BLE/src/BLEAdvertising.cpp
  switch (event) {
    // Advertising data has been configured. Next step: configure scan response if needed,
    // otherwise start advertising directly. This chains the async operations started by start().
    case ESP_GAP_BLE_ADV_DATA_SET_COMPLETE_EVT:
    {
      log_d("Advertising data set complete, status=%d", param->adv_data_cmpl.status);
      if (param->adv_data_cmpl.status != ESP_BT_STATUS_SUCCESS) {
        log_e("Advertising data set failed, status=%d", param->adv_data_cmpl.status);
        freeServiceUUIDs();
        m_advConfiguring = false;
        break;
      }

      if (!m_customScanResponseData && m_scanResp) {
        if (!configureScanResponseData()) {
          freeServiceUUIDs();
          m_advConfiguring = false;
        }
      } else {
        m_advDataSet = true;
        m_advConfiguring = false;
        freeServiceUUIDs();
        esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
        if (errRc != ESP_OK) {
          log_e("esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        }
      }
      break;
    }

    // Scan response data has been configured. Final step: start advertising.
    case ESP_GAP_BLE_SCAN_RSP_DATA_SET_COMPLETE_EVT:
    {
      log_d("Scan response data set complete, status=%d", param->scan_rsp_data_cmpl.status);
      if (param->scan_rsp_data_cmpl.status != ESP_BT_STATUS_SUCCESS) {
        log_e("Scan response data set failed, status=%d", param->scan_rsp_data_cmpl.status);
        freeServiceUUIDs();
        m_advConfiguring = false;
        break;
      }

      m_advDataSet = true;
      m_advConfiguring = false;
      freeServiceUUIDs();
      esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
      if (errRc != ESP_OK) {
        log_e("esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      }
      break;
    }

    case ESP_GAP_BLE_ADV_DATA_RAW_SET_COMPLETE_EVT:
    {
      log_d("Raw advertising data set complete, status=%d", param->adv_data_raw_cmpl.status);
      if (param->adv_data_raw_cmpl.status != ESP_BT_STATUS_SUCCESS) {
        log_e("Raw advertising data set failed, status=%d", param->adv_data_raw_cmpl.status);
        m_advConfiguring = false;
        break;
      }

      m_advDataSet = true;
      m_advConfiguring = false;
      esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
      if (errRc != ESP_OK) {
        log_e("esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
      }
      break;
    }

    case ESP_GAP_BLE_ADV_START_COMPLETE_EVT:
    {
      log_d("Advertising start complete, status=%d", param->adv_start_cmpl.status);
      break;
    }
    case ESP_GAP_BLE_ADV_STOP_COMPLETE_EVT:
    {
      log_i("STOP advertising");
      break;
    }
    default: break;
  }
}

/**
 * @brief Set BLE address.
 * @param [in] Bluetooth address.
 * @param [in] Bluetooth address type.
 * Set BLE address.
 */
bool BLEAdvertising::setDeviceAddress(esp_bd_addr_t addr, esp_ble_addr_type_t type) {
  log_v(">> setPrivateAddress");

  m_advParams.own_addr_type = type;
  esp_err_t errRc = esp_ble_gap_set_rand_addr((uint8_t *)addr);
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_set_rand_addr: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< setPrivateAddress");
  }
  return ESP_OK == errRc;
}  // setPrivateAddress

#if defined(SOC_BLE_50_SUPPORTED)

/**
* @brief           Creator
*
* @param[in]       instance : number of multi advertising instances
*
*
*/
BLEMultiAdvertising::BLEMultiAdvertising(uint8_t num) {
  params_arrays = (esp_ble_gap_ext_adv_params_t *)calloc(num, sizeof(esp_ble_gap_ext_adv_params_t));
  ext_adv = (esp_ble_gap_ext_adv_t *)calloc(num, sizeof(esp_ble_gap_ext_adv_t));
  count = num;
}

/**
* @brief           This function is used by the Host to set the advertising parameters.
*
* @param[in]       instance : identifies the advertising set whose parameters are being configured.
* @param[in]       params   : advertising parameters
*
* @return            - true : success
*                    - false  : failed
*
*/
bool BLEMultiAdvertising::setAdvertisingParams(uint8_t instance, const esp_ble_gap_ext_adv_params_t *params) {
  if (params->type == ESP_BLE_GAP_SET_EXT_ADV_PROP_LEGACY_IND && params->primary_phy == ESP_BLE_GAP_PHY_2M) {
    return false;
  }
  esp_err_t rc;
  rc = esp_ble_gap_ext_adv_set_params(instance, params);

  return ESP_OK == rc;
}

/**
* @brief           This function is used to set the data used in advertising PDUs that have a data field
*
* @param[in]       instance : identifies the advertising set whose data are being configured
* @param[in]       length   : data length
* @param[in]       data     : data information
*
* @return            - true : success
*                    - false  : failed
*
*/
bool BLEMultiAdvertising::setAdvertisingData(uint8_t instance, uint16_t length, const uint8_t *data) {
  esp_err_t rc;
  rc = esp_ble_gap_config_ext_adv_data_raw(instance, length, data);
  if (rc) {
    log_e("set advertising data err: %d", rc);
  }

  return ESP_OK == rc;
}

bool BLEMultiAdvertising::setScanRspData(uint8_t instance, uint16_t length, const uint8_t *data) {
  esp_err_t rc;
  rc = esp_ble_gap_config_ext_scan_rsp_data_raw(instance, length, data);
  if (rc) {
    log_e("set scan resp data err: %d", rc);
  }

  return ESP_OK == rc;
}

/**
* @brief           This function is used to request the Controller to enable one or more
*                  advertising sets using the advertising sets identified by the instance parameter.
*
* @return            - true : success
*                    - false  : failed
*
*/
bool BLEMultiAdvertising::start() {
  return start(count, 0);
}

/**
* @brief           This function is used to request the Controller to enable one or more
*                  advertising sets using the advertising sets identified by the instance parameter.
*
* @param[in]       num : Number of advertising sets to enable or disable
* @param[in]       from : first sxt adv set to use
*
* @return            - true : success
*                    - false  : failed
*
*/
bool BLEMultiAdvertising::start(uint8_t num, uint8_t from) {
  if (num > count || from >= count) {
    return false;
  }

